In [1]:
print('success')

success

In [2]:
import pandas as pd

In [3]:
df = pd.read_csv('https://raw.githubusercontent.com/neuerung/demo/master/Salaries.csv')

In [4]:
df.head()

   rank discipline   phd  service gender    salary
0  Prof          B  56.0       49   Male  186960.0
1  Prof          A  12.0        6   Male   93000.0
2  Prof          A  23.0       20   Male  110515.0
3  Prof          A  40.0       31   Male  131205.0
4  Prof          B  20.0       18   Male  104800.0

In [6]:
df.shape

(78, 6)

In [8]:
df.columns

Index(['rank', 'discipline', 'phd', 'service', 'gender', 'salary'], dtype='object')

In [10]:
df.sample(2)

         rank discipline   phd  service  gender    salary
20   AsstProf          B   4.0        4    Male   92000.0
59  AssocProf          B  12.0       10  Female  103994.0

In [13]:
df[['rank','salary']]

         rank    salary
0        Prof  186960.0
1        Prof   93000.0
2        Prof  110515.0
3        Prof  131205.0
4        Prof  104800.0
..        ...       ...
73       Prof  105450.0
74  AssocProf  104542.0
75       Prof  124312.0
76       Prof  109954.0
77       Prof  109646.0

[78 rows x 2 columns]

In [14]:
df['rank'].unique()

array(['Prof', 'AssocProf', 'AsstProf'], dtype=object)

In [18]:
df['gender'].value_counts()

Male      39
Female    39
Name: gender, dtype: int64

In [19]:
df['salary'].max()

186960.0

In [20]:
df['salary'].min()

57800.0

In [21]:
df['salary'].mean()

108003.3552631579

In [22]:
type(df)

pandas.core.frame.DataFrame